{-

- 右上にあるのがカウンターで、０を送ると値が返ってきて、1を送るとインクリメントされる
- 下に連なっているのがスタックの領域で、0を送るとpopされた値もしくは0が返ってくる。
  1とpushしたい値を送るとpushされる。push後はack的に一回読み込むようにしているので注意。
- `(` (ASCII 40) を読んだら `)` (ASCII 41) を、`[` (ASCII 91) を読んだら `]` (ASCII 93) を、
  `{` (ASCII 123) を読んだら `}` (ASCII 125) を push することで、
  pop 後は値が等しいかだけを比較すれば良いようにしている。

-}
program :: String
program = unlines $
  [ "+-+   +------------------------------------------------------------------+   +-------+"
  , "|I|>->|>@                                                             1sv|>->|>@Wrbdv|"
  , "+-+   |  v       br                                                     <|<-<|^  +1<W|"
  , "      |                 >+   v     >+   v      >+   v                    |   |^s    <|"
  , "      |  >  dv>  rW`40`-X+1+v>`91`-X+2+v>`123`-X+2+v>             v      |   +-------+"
  , "      |  m  > ^         >+   ^     >+   ^      >+   ^                    |            "
  , "      |                     >          >           >W            v       |            "
  , "      |                                                                  |            "
  , "      |                                             >                0sv |            "
  , "      |^  s                                                           r< |            "
  , "      |                                                   > >        1sv |            "
  , "      |                                                            >srv  |            "
  , "      |                                                            0     |            "
  , "      |      >                                           v               |            "
  , "      |                                                                  |            "
  , "      |                                                    > >     ^     |            "
  , "      |                                             ^<     ^X^           |            "
  , "      |^s                                            Xrs0<  ^-rs0 <      |            "
  , "      |                                             ^<    ^ rsWs1<       |            "
  , "+-+   |^s                                                             <  |            "
  , "|O|<-<|  ^                                                             < |            "
  , "+-+   +------------------------------------------------------------------+            "
  ] ++
  (concat . replicate 33)
  [ "                                                    v^                                "
  , "                                                    ||                                "
  , "                                                    v^                                "
  , "                                              +-----------+                           "
  , "                                              |>@WrbWdXs v|                           "
  , "                                              |^< v<vX >v |                           "
  , "                                              | s      sW |                           "
  , "                                              | r         |                           "
  , "                                              |     W     |                           "
  , "                                              |    s1 W   |                           "
  , "                                              |   rWs 0W  |                           "
  , "                                              | ^ <^< sr  |                           "
  , "                                              | ^    <>^  |                           "
  , "                                              |^        <<|                           "
  , "                                              +-----------+                           "
  ] ++
  [ "                                                    v^                                "
  , "                                                    ||                                "
  , "                                                    v^                                "
  , "                                              +-----------+                           "
  , "                                              |>@r0s     v|                           "
  , "                                              |^         <|                           "
  , "                                              +-----------+                           "
  ]

main :: IO ()
main = writeFile "brackets.man" program

